app/controllers/movies_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? ORDER BY created_at DESC  [["movie_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @review = Review.new
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "actors", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "PG-13"], ["updated_at", "2020-09-05 14:08:59.277031"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)