app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT "reviews".* FROM "reviews"

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "Excellent"], ["movie_id", 1], ["user_id", 1], ["created_at", "2020-09-05 01:33:57.215815"], ["updated_at", "2020-09-05 01:33:57.215815"]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]